----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1            [-1, 352, 3000]           5,984
   MyConv1DPadSame-2            [-1, 352, 3000]               0
       BatchNorm1d-3            [-1, 352, 3000]             704
              ReLU-4            [-1, 352, 3000]               0
            Conv1d-5            [-1, 352, 3000]          62,304
   MyConv1DPadSame-6            [-1, 352, 3000]               0
       BatchNorm1d-7            [-1, 352, 3000]             704
              ReLU-8            [-1, 352, 3000]               0
           Dropout-9            [-1, 352, 3000]               0
           Conv1d-10            [-1, 352, 3000]          62,304
  MyConv1DPadSame-11            [-1, 352, 3000]               0
       BasicBlock-12            [-1, 352, 3000]               0
      BatchNorm1d-13            [-1, 352, 3000]             704
             ReLU-14            [-1, 352, 3000]               0
          Dropout-15            [-1, 352, 3000]               0
           Conv1d-16            [-1, 352, 1500]          62,304
  MyConv1DPadSame-17            [-1, 352, 1500]               0
      BatchNorm1d-18            [-1, 352, 1500]             704
             ReLU-19            [-1, 352, 1500]               0
          Dropout-20            [-1, 352, 1500]               0
           Conv1d-21            [-1, 352, 1500]          62,304
  MyConv1DPadSame-22            [-1, 352, 1500]               0
        MaxPool1d-23            [-1, 352, 1500]               0
MyMaxPool1DPadSame-24            [-1, 352, 1500]               0
       BasicBlock-25            [-1, 352, 1500]               0
      BatchNorm1d-26            [-1, 352, 1500]             704
             ReLU-27            [-1, 352, 1500]               0
          Dropout-28            [-1, 352, 1500]               0
           Conv1d-29            [-1, 352, 1500]          62,304
  MyConv1DPadSame-30            [-1, 352, 1500]               0
      BatchNorm1d-31            [-1, 352, 1500]             704
             ReLU-32            [-1, 352, 1500]               0
          Dropout-33            [-1, 352, 1500]               0
           Conv1d-34            [-1, 352, 1500]          62,304
  MyConv1DPadSame-35            [-1, 352, 1500]               0
       BasicBlock-36            [-1, 352, 1500]               0
      BatchNorm1d-37            [-1, 352, 1500]             704
             ReLU-38            [-1, 352, 1500]               0
          Dropout-39            [-1, 352, 1500]               0
           Conv1d-40             [-1, 352, 750]          62,304
  MyConv1DPadSame-41             [-1, 352, 750]               0
      BatchNorm1d-42             [-1, 352, 750]             704
             ReLU-43             [-1, 352, 750]               0
          Dropout-44             [-1, 352, 750]               0
           Conv1d-45             [-1, 352, 750]          62,304
  MyConv1DPadSame-46             [-1, 352, 750]               0
        MaxPool1d-47             [-1, 352, 750]               0
MyMaxPool1DPadSame-48             [-1, 352, 750]               0
       BasicBlock-49             [-1, 352, 750]               0
      BatchNorm1d-50             [-1, 352, 750]             704
             ReLU-51             [-1, 352, 750]               0
          Dropout-52             [-1, 352, 750]               0
           Conv1d-53             [-1, 704, 750]         124,608
  MyConv1DPadSame-54             [-1, 704, 750]               0
      BatchNorm1d-55             [-1, 704, 750]           1,408
             ReLU-56             [-1, 704, 750]               0
          Dropout-57             [-1, 704, 750]               0
           Conv1d-58             [-1, 704, 750]         248,512
  MyConv1DPadSame-59             [-1, 704, 750]               0
       BasicBlock-60             [-1, 704, 750]               0
      BatchNorm1d-61             [-1, 704, 750]           1,408
             ReLU-62             [-1, 704, 750]               0
          Dropout-63             [-1, 704, 750]               0
           Conv1d-64             [-1, 704, 375]         248,512
  MyConv1DPadSame-65             [-1, 704, 375]               0
      BatchNorm1d-66             [-1, 704, 375]           1,408
             ReLU-67             [-1, 704, 375]               0
          Dropout-68             [-1, 704, 375]               0
           Conv1d-69             [-1, 704, 375]         248,512
  MyConv1DPadSame-70             [-1, 704, 375]               0
        MaxPool1d-71             [-1, 704, 375]               0
MyMaxPool1DPadSame-72             [-1, 704, 375]               0
       BasicBlock-73             [-1, 704, 375]               0
      BatchNorm1d-74             [-1, 704, 375]           1,408
             ReLU-75             [-1, 704, 375]               0
          Dropout-76             [-1, 704, 375]               0
           Conv1d-77             [-1, 704, 375]         248,512
  MyConv1DPadSame-78             [-1, 704, 375]               0
      BatchNorm1d-79             [-1, 704, 375]           1,408
             ReLU-80             [-1, 704, 375]               0
          Dropout-81             [-1, 704, 375]               0
           Conv1d-82             [-1, 704, 375]         248,512
  MyConv1DPadSame-83             [-1, 704, 375]               0
       BasicBlock-84             [-1, 704, 375]               0
      BatchNorm1d-85             [-1, 704, 375]           1,408
             ReLU-86             [-1, 704, 375]               0
          Dropout-87             [-1, 704, 375]               0
           Conv1d-88             [-1, 704, 188]         248,512
  MyConv1DPadSame-89             [-1, 704, 188]               0
      BatchNorm1d-90             [-1, 704, 188]           1,408
             ReLU-91             [-1, 704, 188]               0
          Dropout-92             [-1, 704, 188]               0
           Conv1d-93             [-1, 704, 188]         248,512
  MyConv1DPadSame-94             [-1, 704, 188]               0
        MaxPool1d-95             [-1, 704, 188]               0
MyMaxPool1DPadSame-96             [-1, 704, 188]               0
       BasicBlock-97             [-1, 704, 188]               0
      BatchNorm1d-98             [-1, 704, 188]           1,408
             ReLU-99             [-1, 704, 188]               0
         Dropout-100             [-1, 704, 188]               0
          Conv1d-101            [-1, 1408, 188]         497,024
 MyConv1DPadSame-102            [-1, 1408, 188]               0
     BatchNorm1d-103            [-1, 1408, 188]           2,816
            ReLU-104            [-1, 1408, 188]               0
         Dropout-105            [-1, 1408, 188]               0
          Conv1d-106            [-1, 1408, 188]         992,640
 MyConv1DPadSame-107            [-1, 1408, 188]               0
      BasicBlock-108            [-1, 1408, 188]               0
     BatchNorm1d-109            [-1, 1408, 188]           2,816
            ReLU-110            [-1, 1408, 188]               0
         Dropout-111            [-1, 1408, 188]               0
          Conv1d-112             [-1, 1408, 94]         992,640
 MyConv1DPadSame-113             [-1, 1408, 94]               0
     BatchNorm1d-114             [-1, 1408, 94]           2,816
            ReLU-115             [-1, 1408, 94]               0
         Dropout-116             [-1, 1408, 94]               0
          Conv1d-117             [-1, 1408, 94]         992,640
 MyConv1DPadSame-118             [-1, 1408, 94]               0
       MaxPool1d-119             [-1, 1408, 94]               0
MyMaxPool1DPadSame-120             [-1, 1408, 94]               0
      BasicBlock-121             [-1, 1408, 94]               0
     BatchNorm1d-122             [-1, 1408, 94]           2,816
            ReLU-123             [-1, 1408, 94]               0
         Dropout-124             [-1, 1408, 94]               0
          Conv1d-125             [-1, 1408, 94]         992,640
 MyConv1DPadSame-126             [-1, 1408, 94]               0
     BatchNorm1d-127             [-1, 1408, 94]           2,816
            ReLU-128             [-1, 1408, 94]               0
         Dropout-129             [-1, 1408, 94]               0
          Conv1d-130             [-1, 1408, 94]         992,640
 MyConv1DPadSame-131             [-1, 1408, 94]               0
      BasicBlock-132             [-1, 1408, 94]               0
     BatchNorm1d-133             [-1, 1408, 94]           2,816
            ReLU-134             [-1, 1408, 94]               0
         Dropout-135             [-1, 1408, 94]               0
          Conv1d-136             [-1, 1408, 47]         992,640
 MyConv1DPadSame-137             [-1, 1408, 47]               0
     BatchNorm1d-138             [-1, 1408, 47]           2,816
            ReLU-139             [-1, 1408, 47]               0
         Dropout-140             [-1, 1408, 47]               0
          Conv1d-141             [-1, 1408, 47]         992,640
 MyConv1DPadSame-142             [-1, 1408, 47]               0
       MaxPool1d-143             [-1, 1408, 47]               0
MyMaxPool1DPadSame-144             [-1, 1408, 47]               0
      BasicBlock-145             [-1, 1408, 47]               0
     BatchNorm1d-146             [-1, 1408, 47]           2,816
            ReLU-147             [-1, 1408, 47]               0
         Dropout-148             [-1, 1408, 47]               0
          Conv1d-149             [-1, 2816, 47]       1,985,280
 MyConv1DPadSame-150             [-1, 2816, 47]               0
     BatchNorm1d-151             [-1, 2816, 47]           5,632
            ReLU-152             [-1, 2816, 47]               0
         Dropout-153             [-1, 2816, 47]               0
          Conv1d-154             [-1, 2816, 47]       3,967,744
 MyConv1DPadSame-155             [-1, 2816, 47]               0
      BasicBlock-156             [-1, 2816, 47]               0
     BatchNorm1d-157             [-1, 2816, 47]           5,632
            ReLU-158             [-1, 2816, 47]               0
         Dropout-159             [-1, 2816, 47]               0
          Conv1d-160             [-1, 2816, 24]       3,967,744
 MyConv1DPadSame-161             [-1, 2816, 24]               0
     BatchNorm1d-162             [-1, 2816, 24]           5,632
            ReLU-163             [-1, 2816, 24]               0
         Dropout-164             [-1, 2816, 24]               0
          Conv1d-165             [-1, 2816, 24]       3,967,744
 MyConv1DPadSame-166             [-1, 2816, 24]               0
       MaxPool1d-167             [-1, 2816, 24]               0
MyMaxPool1DPadSame-168             [-1, 2816, 24]               0
      BasicBlock-169             [-1, 2816, 24]               0
     BatchNorm1d-170             [-1, 2816, 24]           5,632
            ReLU-171             [-1, 2816, 24]               0
         Dropout-172             [-1, 2816, 24]               0
          Conv1d-173             [-1, 2816, 24]       3,967,744
 MyConv1DPadSame-174             [-1, 2816, 24]               0
     BatchNorm1d-175             [-1, 2816, 24]           5,632
            ReLU-176             [-1, 2816, 24]               0
         Dropout-177             [-1, 2816, 24]               0
          Conv1d-178             [-1, 2816, 24]       3,967,744
 MyConv1DPadSame-179             [-1, 2816, 24]               0
      BasicBlock-180             [-1, 2816, 24]               0
     BatchNorm1d-181             [-1, 2816, 24]           5,632
            ReLU-182             [-1, 2816, 24]               0
          Linear-183                    [-1, 4]          11,268
================================================================
Total params: 31,723,300
Trainable params: 31,723,300
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 425.47
Params size (MB): 121.01
Estimated Total Size (MB): 546.50
----------------------------------------------------------------