----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1             [-1, 64, 3000]           1,088
   MyConv1DPadSame-2             [-1, 64, 3000]               0
       BatchNorm1d-3             [-1, 64, 3000]             128
              ReLU-4             [-1, 64, 3000]               0
            Conv1d-5             [-1, 64, 3000]           2,112
   MyConv1DPadSame-6             [-1, 64, 3000]               0
       BatchNorm1d-7             [-1, 64, 3000]             128
              ReLU-8             [-1, 64, 3000]               0
           Dropout-9             [-1, 64, 3000]               0
           Conv1d-10             [-1, 64, 3000]           2,112
  MyConv1DPadSame-11             [-1, 64, 3000]               0
       BasicBlock-12             [-1, 64, 3000]               0
      BatchNorm1d-13             [-1, 64, 3000]             128
             ReLU-14             [-1, 64, 3000]               0
          Dropout-15             [-1, 64, 3000]               0
           Conv1d-16             [-1, 64, 1500]           2,112
  MyConv1DPadSame-17             [-1, 64, 1500]               0
      BatchNorm1d-18             [-1, 64, 1500]             128
             ReLU-19             [-1, 64, 1500]               0
          Dropout-20             [-1, 64, 1500]               0
           Conv1d-21             [-1, 64, 1500]           2,112
  MyConv1DPadSame-22             [-1, 64, 1500]               0
        MaxPool1d-23             [-1, 64, 1500]               0
MyMaxPool1DPadSame-24             [-1, 64, 1500]               0
       BasicBlock-25             [-1, 64, 1500]               0
      BatchNorm1d-26             [-1, 64, 1500]             128
             ReLU-27             [-1, 64, 1500]               0
          Dropout-28             [-1, 64, 1500]               0
           Conv1d-29             [-1, 64, 1500]           2,112
  MyConv1DPadSame-30             [-1, 64, 1500]               0
      BatchNorm1d-31             [-1, 64, 1500]             128
             ReLU-32             [-1, 64, 1500]               0
          Dropout-33             [-1, 64, 1500]               0
           Conv1d-34             [-1, 64, 1500]           2,112
  MyConv1DPadSame-35             [-1, 64, 1500]               0
       BasicBlock-36             [-1, 64, 1500]               0
      BatchNorm1d-37             [-1, 64, 1500]             128
             ReLU-38             [-1, 64, 1500]               0
          Dropout-39             [-1, 64, 1500]               0
           Conv1d-40              [-1, 64, 750]           2,112
  MyConv1DPadSame-41              [-1, 64, 750]               0
      BatchNorm1d-42              [-1, 64, 750]             128
             ReLU-43              [-1, 64, 750]               0
          Dropout-44              [-1, 64, 750]               0
           Conv1d-45              [-1, 64, 750]           2,112
  MyConv1DPadSame-46              [-1, 64, 750]               0
        MaxPool1d-47              [-1, 64, 750]               0
MyMaxPool1DPadSame-48              [-1, 64, 750]               0
       BasicBlock-49              [-1, 64, 750]               0
      BatchNorm1d-50              [-1, 64, 750]             128
             ReLU-51              [-1, 64, 750]               0
          Dropout-52              [-1, 64, 750]               0
           Conv1d-53             [-1, 128, 750]           4,224
  MyConv1DPadSame-54             [-1, 128, 750]               0
      BatchNorm1d-55             [-1, 128, 750]             256
             ReLU-56             [-1, 128, 750]               0
          Dropout-57             [-1, 128, 750]               0
           Conv1d-58             [-1, 128, 750]           8,320
  MyConv1DPadSame-59             [-1, 128, 750]               0
       BasicBlock-60             [-1, 128, 750]               0
      BatchNorm1d-61             [-1, 128, 750]             256
             ReLU-62             [-1, 128, 750]               0
          Dropout-63             [-1, 128, 750]               0
           Conv1d-64             [-1, 128, 375]           8,320
  MyConv1DPadSame-65             [-1, 128, 375]               0
      BatchNorm1d-66             [-1, 128, 375]             256
             ReLU-67             [-1, 128, 375]               0
          Dropout-68             [-1, 128, 375]               0
           Conv1d-69             [-1, 128, 375]           8,320
  MyConv1DPadSame-70             [-1, 128, 375]               0
        MaxPool1d-71             [-1, 128, 375]               0
MyMaxPool1DPadSame-72             [-1, 128, 375]               0
       BasicBlock-73             [-1, 128, 375]               0
      BatchNorm1d-74             [-1, 128, 375]             256
             ReLU-75             [-1, 128, 375]               0
          Dropout-76             [-1, 128, 375]               0
           Conv1d-77             [-1, 128, 375]           8,320
  MyConv1DPadSame-78             [-1, 128, 375]               0
      BatchNorm1d-79             [-1, 128, 375]             256
             ReLU-80             [-1, 128, 375]               0
          Dropout-81             [-1, 128, 375]               0
           Conv1d-82             [-1, 128, 375]           8,320
  MyConv1DPadSame-83             [-1, 128, 375]               0
       BasicBlock-84             [-1, 128, 375]               0
      BatchNorm1d-85             [-1, 128, 375]             256
             ReLU-86             [-1, 128, 375]               0
          Dropout-87             [-1, 128, 375]               0
           Conv1d-88             [-1, 128, 188]           8,320
  MyConv1DPadSame-89             [-1, 128, 188]               0
      BatchNorm1d-90             [-1, 128, 188]             256
             ReLU-91             [-1, 128, 188]               0
          Dropout-92             [-1, 128, 188]               0
           Conv1d-93             [-1, 128, 188]           8,320
  MyConv1DPadSame-94             [-1, 128, 188]               0
        MaxPool1d-95             [-1, 128, 188]               0
MyMaxPool1DPadSame-96             [-1, 128, 188]               0
       BasicBlock-97             [-1, 128, 188]               0
      BatchNorm1d-98             [-1, 128, 188]             256
             ReLU-99             [-1, 128, 188]               0
         Dropout-100             [-1, 128, 188]               0
          Conv1d-101             [-1, 256, 188]          16,640
 MyConv1DPadSame-102             [-1, 256, 188]               0
     BatchNorm1d-103             [-1, 256, 188]             512
            ReLU-104             [-1, 256, 188]               0
         Dropout-105             [-1, 256, 188]               0
          Conv1d-106             [-1, 256, 188]          33,024
 MyConv1DPadSame-107             [-1, 256, 188]               0
      BasicBlock-108             [-1, 256, 188]               0
     BatchNorm1d-109             [-1, 256, 188]             512
            ReLU-110             [-1, 256, 188]               0
         Dropout-111             [-1, 256, 188]               0
          Conv1d-112              [-1, 256, 94]          33,024
 MyConv1DPadSame-113              [-1, 256, 94]               0
     BatchNorm1d-114              [-1, 256, 94]             512
            ReLU-115              [-1, 256, 94]               0
         Dropout-116              [-1, 256, 94]               0
          Conv1d-117              [-1, 256, 94]          33,024
 MyConv1DPadSame-118              [-1, 256, 94]               0
       MaxPool1d-119              [-1, 256, 94]               0
MyMaxPool1DPadSame-120              [-1, 256, 94]               0
      BasicBlock-121              [-1, 256, 94]               0
     BatchNorm1d-122              [-1, 256, 94]             512
            ReLU-123              [-1, 256, 94]               0
         Dropout-124              [-1, 256, 94]               0
          Conv1d-125              [-1, 256, 94]          33,024
 MyConv1DPadSame-126              [-1, 256, 94]               0
     BatchNorm1d-127              [-1, 256, 94]             512
            ReLU-128              [-1, 256, 94]               0
         Dropout-129              [-1, 256, 94]               0
          Conv1d-130              [-1, 256, 94]          33,024
 MyConv1DPadSame-131              [-1, 256, 94]               0
      BasicBlock-132              [-1, 256, 94]               0
     BatchNorm1d-133              [-1, 256, 94]             512
            ReLU-134              [-1, 256, 94]               0
         Dropout-135              [-1, 256, 94]               0
          Conv1d-136              [-1, 256, 47]          33,024
 MyConv1DPadSame-137              [-1, 256, 47]               0
     BatchNorm1d-138              [-1, 256, 47]             512
            ReLU-139              [-1, 256, 47]               0
         Dropout-140              [-1, 256, 47]               0
          Conv1d-141              [-1, 256, 47]          33,024
 MyConv1DPadSame-142              [-1, 256, 47]               0
       MaxPool1d-143              [-1, 256, 47]               0
MyMaxPool1DPadSame-144              [-1, 256, 47]               0
      BasicBlock-145              [-1, 256, 47]               0
     BatchNorm1d-146              [-1, 256, 47]             512
            ReLU-147              [-1, 256, 47]               0
         Dropout-148              [-1, 256, 47]               0
          Conv1d-149              [-1, 512, 47]          66,048
 MyConv1DPadSame-150              [-1, 512, 47]               0
     BatchNorm1d-151              [-1, 512, 47]           1,024
            ReLU-152              [-1, 512, 47]               0
         Dropout-153              [-1, 512, 47]               0
          Conv1d-154              [-1, 512, 47]         131,584
 MyConv1DPadSame-155              [-1, 512, 47]               0
      BasicBlock-156              [-1, 512, 47]               0
     BatchNorm1d-157              [-1, 512, 47]           1,024
            ReLU-158              [-1, 512, 47]               0
         Dropout-159              [-1, 512, 47]               0
          Conv1d-160              [-1, 512, 24]         131,584
 MyConv1DPadSame-161              [-1, 512, 24]               0
     BatchNorm1d-162              [-1, 512, 24]           1,024
            ReLU-163              [-1, 512, 24]               0
         Dropout-164              [-1, 512, 24]               0
          Conv1d-165              [-1, 512, 24]         131,584
 MyConv1DPadSame-166              [-1, 512, 24]               0
       MaxPool1d-167              [-1, 512, 24]               0
MyMaxPool1DPadSame-168              [-1, 512, 24]               0
      BasicBlock-169              [-1, 512, 24]               0
     BatchNorm1d-170              [-1, 512, 24]           1,024
            ReLU-171              [-1, 512, 24]               0
         Dropout-172              [-1, 512, 24]               0
          Conv1d-173              [-1, 512, 24]         131,584
 MyConv1DPadSame-174              [-1, 512, 24]               0
     BatchNorm1d-175              [-1, 512, 24]           1,024
            ReLU-176              [-1, 512, 24]               0
         Dropout-177              [-1, 512, 24]               0
          Conv1d-178              [-1, 512, 24]         131,584
 MyConv1DPadSame-179              [-1, 512, 24]               0
      BasicBlock-180              [-1, 512, 24]               0
     BatchNorm1d-181              [-1, 512, 24]           1,024
            ReLU-182              [-1, 512, 24]               0
          Linear-183                    [-1, 4]           2,052
================================================================
Total params: 1,067,716
Trainable params: 1,067,716
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 77.36
Params size (MB): 4.07
Estimated Total Size (MB): 81.44
----------------------------------------------------------------