----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1             [-1, 64, 3000]           1,088
   MyConv1DPadSame-2             [-1, 64, 3000]               0
       BatchNorm1d-3             [-1, 64, 3000]             128
              ReLU-4             [-1, 64, 3000]               0
            Conv1d-5             [-1, 64, 3000]           2,112
   MyConv1DPadSame-6             [-1, 64, 3000]               0
       BatchNorm1d-7             [-1, 64, 3000]             128
              ReLU-8             [-1, 64, 3000]               0
           Dropout-9             [-1, 64, 3000]               0
           Conv1d-10             [-1, 64, 3000]           2,112
  MyConv1DPadSame-11             [-1, 64, 3000]               0
       BasicBlock-12             [-1, 64, 3000]               0
      BatchNorm1d-13             [-1, 64, 3000]             128
             ReLU-14             [-1, 64, 3000]               0
          Dropout-15             [-1, 64, 3000]               0
           Conv1d-16             [-1, 64, 1500]           2,112
  MyConv1DPadSame-17             [-1, 64, 1500]               0
      BatchNorm1d-18             [-1, 64, 1500]             128
             ReLU-19             [-1, 64, 1500]               0
          Dropout-20             [-1, 64, 1500]               0
           Conv1d-21             [-1, 64, 1500]           2,112
  MyConv1DPadSame-22             [-1, 64, 1500]               0
        MaxPool1d-23             [-1, 64, 1500]               0
MyMaxPool1DPadSame-24             [-1, 64, 1500]               0
       BasicBlock-25             [-1, 64, 1500]               0
      BatchNorm1d-26             [-1, 64, 1500]             128
             ReLU-27             [-1, 64, 1500]               0
          Dropout-28             [-1, 64, 1500]               0
           Conv1d-29             [-1, 64, 1500]           2,112
  MyConv1DPadSame-30             [-1, 64, 1500]               0
      BatchNorm1d-31             [-1, 64, 1500]             128
             ReLU-32             [-1, 64, 1500]               0
          Dropout-33             [-1, 64, 1500]               0
           Conv1d-34             [-1, 64, 1500]           2,112
  MyConv1DPadSame-35             [-1, 64, 1500]               0
       BasicBlock-36             [-1, 64, 1500]               0
      BatchNorm1d-37             [-1, 64, 1500]             128
             ReLU-38             [-1, 64, 1500]               0
          Dropout-39             [-1, 64, 1500]               0
           Conv1d-40             [-1, 64, 1500]           2,112
  MyConv1DPadSame-41             [-1, 64, 1500]               0
      BatchNorm1d-42             [-1, 64, 1500]             128
             ReLU-43             [-1, 64, 1500]               0
          Dropout-44             [-1, 64, 1500]               0
           Conv1d-45             [-1, 64, 1500]           2,112
  MyConv1DPadSame-46             [-1, 64, 1500]               0
       BasicBlock-47             [-1, 64, 1500]               0
      BatchNorm1d-48             [-1, 64, 1500]             128
             ReLU-49             [-1, 64, 1500]               0
          Dropout-50             [-1, 64, 1500]               0
           Conv1d-51             [-1, 64, 1500]           2,112
  MyConv1DPadSame-52             [-1, 64, 1500]               0
      BatchNorm1d-53             [-1, 64, 1500]             128
             ReLU-54             [-1, 64, 1500]               0
          Dropout-55             [-1, 64, 1500]               0
           Conv1d-56             [-1, 64, 1500]           2,112
  MyConv1DPadSame-57             [-1, 64, 1500]               0
       BasicBlock-58             [-1, 64, 1500]               0
      BatchNorm1d-59             [-1, 64, 1500]             128
             ReLU-60             [-1, 64, 1500]               0
          Dropout-61             [-1, 64, 1500]               0
           Conv1d-62             [-1, 64, 1500]           2,112
  MyConv1DPadSame-63             [-1, 64, 1500]               0
      BatchNorm1d-64             [-1, 64, 1500]             128
             ReLU-65             [-1, 64, 1500]               0
          Dropout-66             [-1, 64, 1500]               0
           Conv1d-67             [-1, 64, 1500]           2,112
  MyConv1DPadSame-68             [-1, 64, 1500]               0
       BasicBlock-69             [-1, 64, 1500]               0
      BatchNorm1d-70             [-1, 64, 1500]             128
             ReLU-71             [-1, 64, 1500]               0
          Dropout-72             [-1, 64, 1500]               0
           Conv1d-73             [-1, 64, 1500]           2,112
  MyConv1DPadSame-74             [-1, 64, 1500]               0
      BatchNorm1d-75             [-1, 64, 1500]             128
             ReLU-76             [-1, 64, 1500]               0
          Dropout-77             [-1, 64, 1500]               0
           Conv1d-78             [-1, 64, 1500]           2,112
  MyConv1DPadSame-79             [-1, 64, 1500]               0
       BasicBlock-80             [-1, 64, 1500]               0
      BatchNorm1d-81             [-1, 64, 1500]             128
             ReLU-82             [-1, 64, 1500]               0
          Dropout-83             [-1, 64, 1500]               0
           Conv1d-84              [-1, 64, 750]           2,112
  MyConv1DPadSame-85              [-1, 64, 750]               0
      BatchNorm1d-86              [-1, 64, 750]             128
             ReLU-87              [-1, 64, 750]               0
          Dropout-88              [-1, 64, 750]               0
           Conv1d-89              [-1, 64, 750]           2,112
  MyConv1DPadSame-90              [-1, 64, 750]               0
        MaxPool1d-91              [-1, 64, 750]               0
MyMaxPool1DPadSame-92              [-1, 64, 750]               0
       BasicBlock-93              [-1, 64, 750]               0
      BatchNorm1d-94              [-1, 64, 750]             128
             ReLU-95              [-1, 64, 750]               0
          Dropout-96              [-1, 64, 750]               0
           Conv1d-97              [-1, 64, 750]           2,112
  MyConv1DPadSame-98              [-1, 64, 750]               0
      BatchNorm1d-99              [-1, 64, 750]             128
            ReLU-100              [-1, 64, 750]               0
         Dropout-101              [-1, 64, 750]               0
          Conv1d-102              [-1, 64, 750]           2,112
 MyConv1DPadSame-103              [-1, 64, 750]               0
      BasicBlock-104              [-1, 64, 750]               0
     BatchNorm1d-105              [-1, 64, 750]             128
            ReLU-106              [-1, 64, 750]               0
         Dropout-107              [-1, 64, 750]               0
          Conv1d-108              [-1, 64, 750]           2,112
 MyConv1DPadSame-109              [-1, 64, 750]               0
     BatchNorm1d-110              [-1, 64, 750]             128
            ReLU-111              [-1, 64, 750]               0
         Dropout-112              [-1, 64, 750]               0
          Conv1d-113              [-1, 64, 750]           2,112
 MyConv1DPadSame-114              [-1, 64, 750]               0
      BasicBlock-115              [-1, 64, 750]               0
     BatchNorm1d-116              [-1, 64, 750]             128
            ReLU-117              [-1, 64, 750]               0
         Dropout-118              [-1, 64, 750]               0
          Conv1d-119              [-1, 64, 750]           2,112
 MyConv1DPadSame-120              [-1, 64, 750]               0
     BatchNorm1d-121              [-1, 64, 750]             128
            ReLU-122              [-1, 64, 750]               0
         Dropout-123              [-1, 64, 750]               0
          Conv1d-124              [-1, 64, 750]           2,112
 MyConv1DPadSame-125              [-1, 64, 750]               0
      BasicBlock-126              [-1, 64, 750]               0
     BatchNorm1d-127              [-1, 64, 750]             128
            ReLU-128              [-1, 64, 750]               0
         Dropout-129              [-1, 64, 750]               0
          Conv1d-130              [-1, 64, 750]           2,112
 MyConv1DPadSame-131              [-1, 64, 750]               0
     BatchNorm1d-132              [-1, 64, 750]             128
            ReLU-133              [-1, 64, 750]               0
         Dropout-134              [-1, 64, 750]               0
          Conv1d-135              [-1, 64, 750]           2,112
 MyConv1DPadSame-136              [-1, 64, 750]               0
      BasicBlock-137              [-1, 64, 750]               0
     BatchNorm1d-138              [-1, 64, 750]             128
            ReLU-139              [-1, 64, 750]               0
         Dropout-140              [-1, 64, 750]               0
          Conv1d-141             [-1, 128, 750]           4,224
 MyConv1DPadSame-142             [-1, 128, 750]               0
     BatchNorm1d-143             [-1, 128, 750]             256
            ReLU-144             [-1, 128, 750]               0
         Dropout-145             [-1, 128, 750]               0
          Conv1d-146             [-1, 128, 750]           8,320
 MyConv1DPadSame-147             [-1, 128, 750]               0
      BasicBlock-148             [-1, 128, 750]               0
     BatchNorm1d-149             [-1, 128, 750]             256
            ReLU-150             [-1, 128, 750]               0
         Dropout-151             [-1, 128, 750]               0
          Conv1d-152             [-1, 128, 375]           8,320
 MyConv1DPadSame-153             [-1, 128, 375]               0
     BatchNorm1d-154             [-1, 128, 375]             256
            ReLU-155             [-1, 128, 375]               0
         Dropout-156             [-1, 128, 375]               0
          Conv1d-157             [-1, 128, 375]           8,320
 MyConv1DPadSame-158             [-1, 128, 375]               0
       MaxPool1d-159             [-1, 128, 375]               0
MyMaxPool1DPadSame-160             [-1, 128, 375]               0
      BasicBlock-161             [-1, 128, 375]               0
     BatchNorm1d-162             [-1, 128, 375]             256
            ReLU-163             [-1, 128, 375]               0
         Dropout-164             [-1, 128, 375]               0
          Conv1d-165             [-1, 128, 375]           8,320
 MyConv1DPadSame-166             [-1, 128, 375]               0
     BatchNorm1d-167             [-1, 128, 375]             256
            ReLU-168             [-1, 128, 375]               0
         Dropout-169             [-1, 128, 375]               0
          Conv1d-170             [-1, 128, 375]           8,320
 MyConv1DPadSame-171             [-1, 128, 375]               0
      BasicBlock-172             [-1, 128, 375]               0
     BatchNorm1d-173             [-1, 128, 375]             256
            ReLU-174             [-1, 128, 375]               0
         Dropout-175             [-1, 128, 375]               0
          Conv1d-176             [-1, 128, 375]           8,320
 MyConv1DPadSame-177             [-1, 128, 375]               0
     BatchNorm1d-178             [-1, 128, 375]             256
            ReLU-179             [-1, 128, 375]               0
         Dropout-180             [-1, 128, 375]               0
          Conv1d-181             [-1, 128, 375]           8,320
 MyConv1DPadSame-182             [-1, 128, 375]               0
      BasicBlock-183             [-1, 128, 375]               0
     BatchNorm1d-184             [-1, 128, 375]             256
            ReLU-185             [-1, 128, 375]               0
         Dropout-186             [-1, 128, 375]               0
          Conv1d-187             [-1, 128, 375]           8,320
 MyConv1DPadSame-188             [-1, 128, 375]               0
     BatchNorm1d-189             [-1, 128, 375]             256
            ReLU-190             [-1, 128, 375]               0
         Dropout-191             [-1, 128, 375]               0
          Conv1d-192             [-1, 128, 375]           8,320
 MyConv1DPadSame-193             [-1, 128, 375]               0
      BasicBlock-194             [-1, 128, 375]               0
     BatchNorm1d-195             [-1, 128, 375]             256
            ReLU-196             [-1, 128, 375]               0
         Dropout-197             [-1, 128, 375]               0
          Conv1d-198             [-1, 128, 375]           8,320
 MyConv1DPadSame-199             [-1, 128, 375]               0
     BatchNorm1d-200             [-1, 128, 375]             256
            ReLU-201             [-1, 128, 375]               0
         Dropout-202             [-1, 128, 375]               0
          Conv1d-203             [-1, 128, 375]           8,320
 MyConv1DPadSame-204             [-1, 128, 375]               0
      BasicBlock-205             [-1, 128, 375]               0
     BatchNorm1d-206             [-1, 128, 375]             256
            ReLU-207             [-1, 128, 375]               0
         Dropout-208             [-1, 128, 375]               0
          Conv1d-209             [-1, 128, 375]           8,320
 MyConv1DPadSame-210             [-1, 128, 375]               0
     BatchNorm1d-211             [-1, 128, 375]             256
            ReLU-212             [-1, 128, 375]               0
         Dropout-213             [-1, 128, 375]               0
          Conv1d-214             [-1, 128, 375]           8,320
 MyConv1DPadSame-215             [-1, 128, 375]               0
      BasicBlock-216             [-1, 128, 375]               0
     BatchNorm1d-217             [-1, 128, 375]             256
            ReLU-218             [-1, 128, 375]               0
         Dropout-219             [-1, 128, 375]               0
          Conv1d-220             [-1, 128, 188]           8,320
 MyConv1DPadSame-221             [-1, 128, 188]               0
     BatchNorm1d-222             [-1, 128, 188]             256
            ReLU-223             [-1, 128, 188]               0
         Dropout-224             [-1, 128, 188]               0
          Conv1d-225             [-1, 128, 188]           8,320
 MyConv1DPadSame-226             [-1, 128, 188]               0
       MaxPool1d-227             [-1, 128, 188]               0
MyMaxPool1DPadSame-228             [-1, 128, 188]               0
      BasicBlock-229             [-1, 128, 188]               0
     BatchNorm1d-230             [-1, 128, 188]             256
            ReLU-231             [-1, 128, 188]               0
         Dropout-232             [-1, 128, 188]               0
          Conv1d-233             [-1, 128, 188]           8,320
 MyConv1DPadSame-234             [-1, 128, 188]               0
     BatchNorm1d-235             [-1, 128, 188]             256
            ReLU-236             [-1, 128, 188]               0
         Dropout-237             [-1, 128, 188]               0
          Conv1d-238             [-1, 128, 188]           8,320
 MyConv1DPadSame-239             [-1, 128, 188]               0
      BasicBlock-240             [-1, 128, 188]               0
     BatchNorm1d-241             [-1, 128, 188]             256
            ReLU-242             [-1, 128, 188]               0
         Dropout-243             [-1, 128, 188]               0
          Conv1d-244             [-1, 128, 188]           8,320
 MyConv1DPadSame-245             [-1, 128, 188]               0
     BatchNorm1d-246             [-1, 128, 188]             256
            ReLU-247             [-1, 128, 188]               0
         Dropout-248             [-1, 128, 188]               0
          Conv1d-249             [-1, 128, 188]           8,320
 MyConv1DPadSame-250             [-1, 128, 188]               0
      BasicBlock-251             [-1, 128, 188]               0
     BatchNorm1d-252             [-1, 128, 188]             256
            ReLU-253             [-1, 128, 188]               0
         Dropout-254             [-1, 128, 188]               0
          Conv1d-255             [-1, 128, 188]           8,320
 MyConv1DPadSame-256             [-1, 128, 188]               0
     BatchNorm1d-257             [-1, 128, 188]             256
            ReLU-258             [-1, 128, 188]               0
         Dropout-259             [-1, 128, 188]               0
          Conv1d-260             [-1, 128, 188]           8,320
 MyConv1DPadSame-261             [-1, 128, 188]               0
      BasicBlock-262             [-1, 128, 188]               0
     BatchNorm1d-263             [-1, 128, 188]             256
            ReLU-264             [-1, 128, 188]               0
         Dropout-265             [-1, 128, 188]               0
          Conv1d-266             [-1, 128, 188]           8,320
 MyConv1DPadSame-267             [-1, 128, 188]               0
     BatchNorm1d-268             [-1, 128, 188]             256
            ReLU-269             [-1, 128, 188]               0
         Dropout-270             [-1, 128, 188]               0
          Conv1d-271             [-1, 128, 188]           8,320
 MyConv1DPadSame-272             [-1, 128, 188]               0
      BasicBlock-273             [-1, 128, 188]               0
     BatchNorm1d-274             [-1, 128, 188]             256
            ReLU-275             [-1, 128, 188]               0
         Dropout-276             [-1, 128, 188]               0
          Conv1d-277             [-1, 256, 188]          16,640
 MyConv1DPadSame-278             [-1, 256, 188]               0
     BatchNorm1d-279             [-1, 256, 188]             512
            ReLU-280             [-1, 256, 188]               0
         Dropout-281             [-1, 256, 188]               0
          Conv1d-282             [-1, 256, 188]          33,024
 MyConv1DPadSame-283             [-1, 256, 188]               0
      BasicBlock-284             [-1, 256, 188]               0
     BatchNorm1d-285             [-1, 256, 188]             512
            ReLU-286             [-1, 256, 188]               0
         Dropout-287             [-1, 256, 188]               0
          Conv1d-288              [-1, 256, 94]          33,024
 MyConv1DPadSame-289              [-1, 256, 94]               0
     BatchNorm1d-290              [-1, 256, 94]             512
            ReLU-291              [-1, 256, 94]               0
         Dropout-292              [-1, 256, 94]               0
          Conv1d-293              [-1, 256, 94]          33,024
 MyConv1DPadSame-294              [-1, 256, 94]               0
       MaxPool1d-295              [-1, 256, 94]               0
MyMaxPool1DPadSame-296              [-1, 256, 94]               0
      BasicBlock-297              [-1, 256, 94]               0
     BatchNorm1d-298              [-1, 256, 94]             512
            ReLU-299              [-1, 256, 94]               0
         Dropout-300              [-1, 256, 94]               0
          Conv1d-301              [-1, 256, 94]          33,024
 MyConv1DPadSame-302              [-1, 256, 94]               0
     BatchNorm1d-303              [-1, 256, 94]             512
            ReLU-304              [-1, 256, 94]               0
         Dropout-305              [-1, 256, 94]               0
          Conv1d-306              [-1, 256, 94]          33,024
 MyConv1DPadSame-307              [-1, 256, 94]               0
      BasicBlock-308              [-1, 256, 94]               0
     BatchNorm1d-309              [-1, 256, 94]             512
            ReLU-310              [-1, 256, 94]               0
         Dropout-311              [-1, 256, 94]               0
          Conv1d-312              [-1, 256, 94]          33,024
 MyConv1DPadSame-313              [-1, 256, 94]               0
     BatchNorm1d-314              [-1, 256, 94]             512
            ReLU-315              [-1, 256, 94]               0
         Dropout-316              [-1, 256, 94]               0
          Conv1d-317              [-1, 256, 94]          33,024
 MyConv1DPadSame-318              [-1, 256, 94]               0
      BasicBlock-319              [-1, 256, 94]               0
     BatchNorm1d-320              [-1, 256, 94]             512
            ReLU-321              [-1, 256, 94]               0
         Dropout-322              [-1, 256, 94]               0
          Conv1d-323              [-1, 256, 94]          33,024
 MyConv1DPadSame-324              [-1, 256, 94]               0
     BatchNorm1d-325              [-1, 256, 94]             512
            ReLU-326              [-1, 256, 94]               0
         Dropout-327              [-1, 256, 94]               0
          Conv1d-328              [-1, 256, 94]          33,024
 MyConv1DPadSame-329              [-1, 256, 94]               0
      BasicBlock-330              [-1, 256, 94]               0
     BatchNorm1d-331              [-1, 256, 94]             512
            ReLU-332              [-1, 256, 94]               0
         Dropout-333              [-1, 256, 94]               0
          Conv1d-334              [-1, 256, 94]          33,024
 MyConv1DPadSame-335              [-1, 256, 94]               0
     BatchNorm1d-336              [-1, 256, 94]             512
            ReLU-337              [-1, 256, 94]               0
         Dropout-338              [-1, 256, 94]               0
          Conv1d-339              [-1, 256, 94]          33,024
 MyConv1DPadSame-340              [-1, 256, 94]               0
      BasicBlock-341              [-1, 256, 94]               0
     BatchNorm1d-342              [-1, 256, 94]             512
            ReLU-343              [-1, 256, 94]               0
         Dropout-344              [-1, 256, 94]               0
          Conv1d-345              [-1, 256, 94]          33,024
 MyConv1DPadSame-346              [-1, 256, 94]               0
     BatchNorm1d-347              [-1, 256, 94]             512
            ReLU-348              [-1, 256, 94]               0
         Dropout-349              [-1, 256, 94]               0
          Conv1d-350              [-1, 256, 94]          33,024
 MyConv1DPadSame-351              [-1, 256, 94]               0
      BasicBlock-352              [-1, 256, 94]               0
     BatchNorm1d-353              [-1, 256, 94]             512
            ReLU-354              [-1, 256, 94]               0
         Dropout-355              [-1, 256, 94]               0
          Conv1d-356              [-1, 256, 47]          33,024
 MyConv1DPadSame-357              [-1, 256, 47]               0
     BatchNorm1d-358              [-1, 256, 47]             512
            ReLU-359              [-1, 256, 47]               0
         Dropout-360              [-1, 256, 47]               0
          Conv1d-361              [-1, 256, 47]          33,024
 MyConv1DPadSame-362              [-1, 256, 47]               0
       MaxPool1d-363              [-1, 256, 47]               0
MyMaxPool1DPadSame-364              [-1, 256, 47]               0
      BasicBlock-365              [-1, 256, 47]               0
     BatchNorm1d-366              [-1, 256, 47]             512
            ReLU-367              [-1, 256, 47]               0
         Dropout-368              [-1, 256, 47]               0
          Conv1d-369              [-1, 256, 47]          33,024
 MyConv1DPadSame-370              [-1, 256, 47]               0
     BatchNorm1d-371              [-1, 256, 47]             512
            ReLU-372              [-1, 256, 47]               0
         Dropout-373              [-1, 256, 47]               0
          Conv1d-374              [-1, 256, 47]          33,024
 MyConv1DPadSame-375              [-1, 256, 47]               0
      BasicBlock-376              [-1, 256, 47]               0
     BatchNorm1d-377              [-1, 256, 47]             512
            ReLU-378              [-1, 256, 47]               0
         Dropout-379              [-1, 256, 47]               0
          Conv1d-380              [-1, 256, 47]          33,024
 MyConv1DPadSame-381              [-1, 256, 47]               0
     BatchNorm1d-382              [-1, 256, 47]             512
            ReLU-383              [-1, 256, 47]               0
         Dropout-384              [-1, 256, 47]               0
          Conv1d-385              [-1, 256, 47]          33,024
 MyConv1DPadSame-386              [-1, 256, 47]               0
      BasicBlock-387              [-1, 256, 47]               0
     BatchNorm1d-388              [-1, 256, 47]             512
            ReLU-389              [-1, 256, 47]               0
         Dropout-390              [-1, 256, 47]               0
          Conv1d-391              [-1, 256, 47]          33,024
 MyConv1DPadSame-392              [-1, 256, 47]               0
     BatchNorm1d-393              [-1, 256, 47]             512
            ReLU-394              [-1, 256, 47]               0
         Dropout-395              [-1, 256, 47]               0
          Conv1d-396              [-1, 256, 47]          33,024
 MyConv1DPadSame-397              [-1, 256, 47]               0
      BasicBlock-398              [-1, 256, 47]               0
     BatchNorm1d-399              [-1, 256, 47]             512
            ReLU-400              [-1, 256, 47]               0
         Dropout-401              [-1, 256, 47]               0
          Conv1d-402              [-1, 256, 47]          33,024
 MyConv1DPadSame-403              [-1, 256, 47]               0
     BatchNorm1d-404              [-1, 256, 47]             512
            ReLU-405              [-1, 256, 47]               0
         Dropout-406              [-1, 256, 47]               0
          Conv1d-407              [-1, 256, 47]          33,024
 MyConv1DPadSame-408              [-1, 256, 47]               0
      BasicBlock-409              [-1, 256, 47]               0
     BatchNorm1d-410              [-1, 256, 47]             512
            ReLU-411              [-1, 256, 47]               0
         Dropout-412              [-1, 256, 47]               0
          Conv1d-413              [-1, 512, 47]          66,048
 MyConv1DPadSame-414              [-1, 512, 47]               0
     BatchNorm1d-415              [-1, 512, 47]           1,024
            ReLU-416              [-1, 512, 47]               0
         Dropout-417              [-1, 512, 47]               0
          Conv1d-418              [-1, 512, 47]         131,584
 MyConv1DPadSame-419              [-1, 512, 47]               0
      BasicBlock-420              [-1, 512, 47]               0
     BatchNorm1d-421              [-1, 512, 47]           1,024
            ReLU-422              [-1, 512, 47]               0
         Dropout-423              [-1, 512, 47]               0
          Conv1d-424              [-1, 512, 24]         131,584
 MyConv1DPadSame-425              [-1, 512, 24]               0
     BatchNorm1d-426              [-1, 512, 24]           1,024
            ReLU-427              [-1, 512, 24]               0
         Dropout-428              [-1, 512, 24]               0
          Conv1d-429              [-1, 512, 24]         131,584
 MyConv1DPadSame-430              [-1, 512, 24]               0
       MaxPool1d-431              [-1, 512, 24]               0
MyMaxPool1DPadSame-432              [-1, 512, 24]               0
      BasicBlock-433              [-1, 512, 24]               0
     BatchNorm1d-434              [-1, 512, 24]           1,024
            ReLU-435              [-1, 512, 24]               0
         Dropout-436              [-1, 512, 24]               0
          Conv1d-437              [-1, 512, 24]         131,584
 MyConv1DPadSame-438              [-1, 512, 24]               0
     BatchNorm1d-439              [-1, 512, 24]           1,024
            ReLU-440              [-1, 512, 24]               0
         Dropout-441              [-1, 512, 24]               0
          Conv1d-442              [-1, 512, 24]         131,584
 MyConv1DPadSame-443              [-1, 512, 24]               0
      BasicBlock-444              [-1, 512, 24]               0
     BatchNorm1d-445              [-1, 512, 24]           1,024
            ReLU-446              [-1, 512, 24]               0
         Dropout-447              [-1, 512, 24]               0
          Conv1d-448              [-1, 512, 24]         131,584
 MyConv1DPadSame-449              [-1, 512, 24]               0
     BatchNorm1d-450              [-1, 512, 24]           1,024
            ReLU-451              [-1, 512, 24]               0
         Dropout-452              [-1, 512, 24]               0
          Conv1d-453              [-1, 512, 24]         131,584
 MyConv1DPadSame-454              [-1, 512, 24]               0
      BasicBlock-455              [-1, 512, 24]               0
     BatchNorm1d-456              [-1, 512, 24]           1,024
            ReLU-457              [-1, 512, 24]               0
         Dropout-458              [-1, 512, 24]               0
          Conv1d-459              [-1, 512, 24]         131,584
 MyConv1DPadSame-460              [-1, 512, 24]               0
     BatchNorm1d-461              [-1, 512, 24]           1,024
            ReLU-462              [-1, 512, 24]               0
         Dropout-463              [-1, 512, 24]               0
          Conv1d-464              [-1, 512, 24]         131,584
 MyConv1DPadSame-465              [-1, 512, 24]               0
      BasicBlock-466              [-1, 512, 24]               0
     BatchNorm1d-467              [-1, 512, 24]           1,024
            ReLU-468              [-1, 512, 24]               0
         Dropout-469              [-1, 512, 24]               0
          Conv1d-470              [-1, 512, 24]         131,584
 MyConv1DPadSame-471              [-1, 512, 24]               0
     BatchNorm1d-472              [-1, 512, 24]           1,024
            ReLU-473              [-1, 512, 24]               0
         Dropout-474              [-1, 512, 24]               0
          Conv1d-475              [-1, 512, 24]         131,584
 MyConv1DPadSame-476              [-1, 512, 24]               0
      BasicBlock-477              [-1, 512, 24]               0
     BatchNorm1d-478              [-1, 512, 24]           1,024
            ReLU-479              [-1, 512, 24]               0
         Dropout-480              [-1, 512, 24]               0
          Conv1d-481              [-1, 512, 24]         131,584
 MyConv1DPadSame-482              [-1, 512, 24]               0
     BatchNorm1d-483              [-1, 512, 24]           1,024
            ReLU-484              [-1, 512, 24]               0
         Dropout-485              [-1, 512, 24]               0
          Conv1d-486              [-1, 512, 24]         131,584
 MyConv1DPadSame-487              [-1, 512, 24]               0
      BasicBlock-488              [-1, 512, 24]               0
     BatchNorm1d-489              [-1, 512, 24]           1,024
            ReLU-490              [-1, 512, 24]               0
         Dropout-491              [-1, 512, 24]               0
          Conv1d-492              [-1, 512, 12]         131,584
 MyConv1DPadSame-493              [-1, 512, 12]               0
     BatchNorm1d-494              [-1, 512, 12]           1,024
            ReLU-495              [-1, 512, 12]               0
         Dropout-496              [-1, 512, 12]               0
          Conv1d-497              [-1, 512, 12]         131,584
 MyConv1DPadSame-498              [-1, 512, 12]               0
       MaxPool1d-499              [-1, 512, 12]               0
MyMaxPool1DPadSame-500              [-1, 512, 12]               0
      BasicBlock-501              [-1, 512, 12]               0
     BatchNorm1d-502              [-1, 512, 12]           1,024
            ReLU-503              [-1, 512, 12]               0
         Dropout-504              [-1, 512, 12]               0
          Conv1d-505              [-1, 512, 12]         131,584
 MyConv1DPadSame-506              [-1, 512, 12]               0
     BatchNorm1d-507              [-1, 512, 12]           1,024
            ReLU-508              [-1, 512, 12]               0
         Dropout-509              [-1, 512, 12]               0
          Conv1d-510              [-1, 512, 12]         131,584
 MyConv1DPadSame-511              [-1, 512, 12]               0
      BasicBlock-512              [-1, 512, 12]               0
     BatchNorm1d-513              [-1, 512, 12]           1,024
            ReLU-514              [-1, 512, 12]               0
         Dropout-515              [-1, 512, 12]               0
          Conv1d-516              [-1, 512, 12]         131,584
 MyConv1DPadSame-517              [-1, 512, 12]               0
     BatchNorm1d-518              [-1, 512, 12]           1,024
            ReLU-519              [-1, 512, 12]               0
         Dropout-520              [-1, 512, 12]               0
          Conv1d-521              [-1, 512, 12]         131,584
 MyConv1DPadSame-522              [-1, 512, 12]               0
      BasicBlock-523              [-1, 512, 12]               0
     BatchNorm1d-524              [-1, 512, 12]           1,024
            ReLU-525              [-1, 512, 12]               0
         Dropout-526              [-1, 512, 12]               0
          Conv1d-527              [-1, 512, 12]         131,584
 MyConv1DPadSame-528              [-1, 512, 12]               0
     BatchNorm1d-529              [-1, 512, 12]           1,024
            ReLU-530              [-1, 512, 12]               0
         Dropout-531              [-1, 512, 12]               0
          Conv1d-532              [-1, 512, 12]         131,584
 MyConv1DPadSame-533              [-1, 512, 12]               0
      BasicBlock-534              [-1, 512, 12]               0
     BatchNorm1d-535              [-1, 512, 12]           1,024
            ReLU-536              [-1, 512, 12]               0
         Dropout-537              [-1, 512, 12]               0
          Conv1d-538              [-1, 512, 12]         131,584
 MyConv1DPadSame-539              [-1, 512, 12]               0
     BatchNorm1d-540              [-1, 512, 12]           1,024
            ReLU-541              [-1, 512, 12]               0
         Dropout-542              [-1, 512, 12]               0
          Conv1d-543              [-1, 512, 12]         131,584
 MyConv1DPadSame-544              [-1, 512, 12]               0
      BasicBlock-545              [-1, 512, 12]               0
     BatchNorm1d-546              [-1, 512, 12]           1,024
            ReLU-547              [-1, 512, 12]               0
          Linear-548                    [-1, 4]           2,052
================================================================
Total params: 4,164,292
Trainable params: 4,164,292
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 168.85
Params size (MB): 15.89
Estimated Total Size (MB): 184.75
----------------------------------------------------------------